{
    "id": "confluence-062",
    "title": "ICBINN",
    "url": "https://openxt.atlassian.net/wiki/spaces/DC/pages/44498951/ICBINN",
    "content": "<p>Owned by Ross Philipson\nLast updated: Jun 30, 2016 by Ross Philipson\n\n</p><ac:structured-macro ac:macro-id=\"8b686237-640b-4a99-aad7-c28571c6b798\" ac:name=\"info\" ac:schema-version=\"1\"><ac:parameter ac:name=\"icon\">None</ac:parameter><ac:rich-text-body><p><ac:image ac:width=\"80\"><ri:attachment ri:filename=\"cc-by.png\"></ri:attachment></ac:image></p><p>Copyright 2012 by Citrix Systems, Inc. This work is licensed under the Creative Commons Attribution 4.0 International License. To view a copy of this license, visit <a class=\"external-link\" href=\"http://creativecommons.org/licenses/by/4.0/\" rel=\"nofollow\">http://creativecommons.org/licenses/by/4.0/</a>.</p></ac:rich-text-body></ac:structured-macro><p>icbinn is \"I can't believe it's not NFS\". It is like NFS, but uses lib<a href=\"http://starchy.openxt.stuffs/wiki/index.php/V4v\" title=\"V4v\">v4v</a> and libtirpc.</p><p>icbinn allows VMs to access dom0's filesystem and perform operations like readdir, stat, open, pread, pwrite, rename etc. For a complete list of operations supported, please refer to the icbinn protocol description file icbinn_prot.x. The icbinn server runs in dom0.</p><p>The icbinn \"paths\" of a vm indicate directory trees that VM can access. We currently support 2 icbinn paths for each vm, and the icbinn-path vm property is a comma-separated list of paths. You can set the icbinn-path for the vm, using xec-vm -n &lt;vmname&gt; set icbinn-path.</p><p>The icbinn server listens on two ports: 4878 and 4879. If a client connects to port 4878, it will get access to the first icbinn-path set in the VMs icbinn-path property, and so on.</p><p>In order to use icbinn from a VM, a client library needs to be installed in the vm (libicbinn), but you would need to write your own client which uses this library. E.g. syncvm has its own python client, which uses libicbinn.</p>",
    "date": "2024-11-15",
    "disclaimer": "Users of this benchmark dataset are advised to check Atlassian’s official documentation for the most current information.",
    "space": "DC"
}