{
    "id": "confluence-130",
    "title": "September 2017 OpenXT Community Call",
    "url": "https://openxt.atlassian.net/wiki/spaces/CS/pages/138575939/September+2017+OpenXT+Community+Call",
    "content": "<p>Owned by Rich Persaud\nLast updated: Oct 19, 2017 by Rich Persaud\n\n</p><h3>Monthly Call Agenda</h3><p>* Maintainer and plans for stable-6 branch (6.1.x)<br/>* Release manager for next stable-7 release (7.0.x, 7.1.x)<br/>* Release manager for 8.0.0</p><p><em>* OpenXT 8.0.0 Status</em><br/> - Xen 4.9<br/> - blktap<br/> - pyro</p><p><em>* OpenXT 8.0.0 Planning</em><br/> - HVM driver domains<br/> - measured launch<br/> - vTPM<br/> - USB3 support<br/> - USB driver domain<br/> - libvirt<br/> - host license key management<br/> - Hyper-V guest enlightenments<br/> - Upstream Xen Windows PV drivers<br/> - Display manager &amp; input server<br/> - Attack surface reduction: Kconfig, restrict grant table version via Xen cmdline</p><h3>Monthly Call Minutes</h3><p><em>PCI device reset/FLR - OXT-1217</em></p><ul><li>A variation of this patch belongs in upstream Xen &amp; Linux. See Jira ticket for link to upstream Xen thread. If we can maintain a list of PCI devices (e.g. lspci -v output for GPU, NIC) which require this patch, it will help with OpenXT and upstream testing.</li></ul><p><em>What happens to open stable-7 tickets after the release of 7.0.0?</em></p><ul><li>Some issues will be release noted</li><li>\"Affects Version\" remains 7.0.0</li><li>\"Fix Version\" to be triaged (7.1.0, Backlog, or none)</li></ul><p><em>stable-6 branch (6.1.x)</em></p><ul><li>Maintainer nomination: need input from Rich Turner</li><li>Eric submitted a versioning proposal on mailing list (add some XSAs, tag 6.0.1, move to 6.1.0, add Xen 4.6 &amp; XSAs), no objections</li><li>Build and archive 6.0.1 release binaries</li><li>Focus moves to 6.1.0</li></ul><p><em>stable-7 branch (7.0.x, 7.1.x)</em></p><ul><li>No volunteers for stable-7 release manager. Rich Persaud nominated Eric Chanudet of AIS. Eric requires mgmt approval. Defer to Oct call.</li><li>Should there be a 7.0.1 bugfix/security release, in advance of 7.1 release with Intel Coffee Lake hardware support?</li></ul><p><em>master (8.0.0)</em></p><ul><li>Rich Persaud volunteered to be release manager for 8.0.0, will request technical assistance from others as needed.</li><li>8.0 will target Intel Ice Lake hardware (2018/2019) and fundamental architectural changes to enable extensible OpenXT base platform</li><li>Notes from feature discussion<br/><ul><li style=\"margin-left: 0.0px;\">UEFI (host and guest), Secure Boot for Windows 10</li><li style=\"margin-left: 0.0px;\">Kconfig - define minimal Xen config early in 8.0 dev cycle, so that testing &amp; feature development are done on the minimized base</li><li style=\"margin-left: 0.0px;\">USB3 - no high-priority devices currently need USB3, USB-C ports are compatible</li><li style=\"margin-left: 0.0px;\">USB driver domain - of interest, will be investigated, not yet committed within 8.0 timeframe, Qubes has an implementation</li><li style=\"margin-left: 0.0px;\">HVM and SR-IOV driver domains - security benefits, see upstream Xen mailing list discussion about x86 PCI passthrough security</li><li style=\"margin-left: 0.0px;\">libvirt - needs scoping, starting point would be for Chris Rogers to create a wiki page which documents OpenXT Haskell toolstack functions that would need to be migrated to another toolstack, whether libvirt or something else. There will always be some OpenXT-specific toolstack functions that are not provided by an existing toolstack like libvirt. This is a big task, we need to create small prototypes to identity candidates for replacing subsets of Haskell code.</li><li style=\"margin-left: 0.0px;\">Hyper-V guest enlightenments - of interest, is available in Xen 4.9, can be an optional build configuration for OpenXT 8.0</li><li style=\"margin-left: 0.0px;\">Display manager &amp; input server - no objection to the community introducing a new, optional, open-source display/input stack</li><li style=\"margin-left: 0.0px;\">Upstream OE - some 8.0 OpenXT features may appear first in upstream OpenEmbedded meta-virtualization (master), then get pulled into OpenXT</li><li style=\"margin-left: 0.0px;\">OE pyro uprev - work underway (Eric), making Haskell toolchain fixes</li><li style=\"margin-left: 0.0px;\">blktap3 - work underway, see OXT-1221 (Mahantesh)</li><li style=\"margin-left: 0.0px;\">nested virt (Hyper-V) - targeted for 8.0 release, no backport to stable-5</li></ul></li></ul>",
    "date": "2024-11-15",
    "disclaimer": "Users of this benchmark dataset are advised to check Atlassian’s official documentation for the most current information.",
    "space": "CS"
}