{
    "id": "confluence-009",
    "title": "OpenXT Governance - Original",
    "url": "https://openxt.atlassian.net/wiki/spaces/~rphilipson/pages/26574899/OpenXT+Governance+-+Original",
    "content": "<p>Owned by Ross Philipson\nLast updated: Mar 10, 2016 by Ross Philipson\n\n</p><ac:structured-macro ac:macro-id=\"d94532cc-823a-4d33-9480-a58ccf8d4b0c\" ac:name=\"info\" ac:schema-version=\"1\"><ac:parameter ac:name=\"icon\">None</ac:parameter><ac:rich-text-body><p><ac:image ac:width=\"80\"><ri:attachment ri:filename=\"cc-by.png\"></ri:attachment></ac:image></p><p>Copyright 2016 by Assured Information Security, Inc. Created by Ross Philipson &lt;philipsonr@<a href=\"http://ainfosec.com\">ainfosec.com</a>&gt;. This work is licensed under the Creative Commons Attribution 4.0 International License. To view a copy of this license, visit <a class=\"external-link\" href=\"http://creativecommons.org/licenses/by/4.0/\" rel=\"nofollow\">http://creativecommons.org/licenses/by/4.0/</a>.</p></ac:rich-text-body></ac:structured-macro><p><ac:structured-macro ac:macro-id=\"e1e5f946-384e-4caf-ad66-b07c0c676ff6\" ac:name=\"toc\" ac:schema-version=\"1\"></ac:structured-macro></p><h2>Governance 2016 - Introduction</h2><p>There have been a number of governance proposals at different times (some public, some not). While they all seem reasonable, they all also seem too complex for what we really want and need today in the currently small OpenXT community. What will be presented here is a slimmed down approach to cover mainly what we need as of today. This does not mean we cannot expand our governance model in the future.</p><p>Currently we have a process in place for the OpenXT project. Please review the <ac:link><ri:page ri:content-title=\"OpenXT Process - Historical\" ri:space-key=\"CS\"></ri:page></ac:link> which outlines how things are currently done (in 2016 and earlier). There are cases where technical issues arise that the current process cannot handle or resolve. This initial minimal governance model's main goal is to address this problem and to in effect boot-strap governance in general on the OpenXT project.</p><h2>Initial Governance Model</h2><h3>Technical Advisory Board</h3><p>An initial body of an odd number of individuals will be formed by community agreement. This body represents the interests of parties involved in the OpenXT project as well as the interests of the OpenXT platform itself. The exact number is variable but initially it should be somewhere between 5 and 9 individuals. This body will effectively form a Technical Advisory Board that will make decisions regarding technical issues that impact OpenXT and cannot be easily resolved by the existing process. The exact nature of the resolution may vary widely on a case by case basis. These are some examples just to illustrate that it is not just a yes/no vote.</p><ul><li>The board votes to accept/reject a proposed feature or change in OpenXT.</li><li>The board decides to request more information regarding a submission or RFC before further consideration.</li><li>The board decides to request an alteration to a submission or RFC before further consideration or as criteria for acceptance.</li><li>The board defers to an outside expert or agency that can better evaluate and make recommendations.</li></ul><h3>Decision Process</h3><p>Action by the Technical Advisory Board will only be invoked in the situation where no resolution to a technical matter can be reached using the existing process and informal discussions. Action is initiated by creating a JIRA ticket to fully describe the technical issue that needs resolution. All activity concerning the resolution process will be tracked in the ticket. When a resolution of some form is reached, it will also be entered into the ticket. When the decided upon resolution is enacted, the ticket can be closed. This leaves a concrete information trail on exactly what transpired and what the resolution ultimately was.</p><p>Part of the decision process will involve voting. This will be done with a simple <strong>+1</strong> or <strong>-1</strong> vote by each member. Any member can elect to abstain from voting for whatever reason public or private (which is a vote of <strong>0</strong>). Voting can commence when a majority of the Technical Advisory Board believes it is appropriate. The results of the vote will be recorded in the ticket.</p><p>In cases where members cannot participate because they are indisposed for whatever reason or when voting is tied, the Technical Advisory Board will have to make a best effort attempt at determining how to proceed.</p><h3>Scope of Mandate</h3><p>The scope of what the body is mandated to make decisions on is limited to technical issues impacting OpenXT that cannot be resolved using the existing process. If the scope of this mandate needs to be expanded at a future date, this governance model will need to be altered with input and participation from the entire OpenXT community.</p><h2>OpenXT Governance and Process</h2><p>The end result in 2016 will be the realization of an OpenXT Governance and Process model that is based on the initial governance model described above and the existing process that is currently in place for OpenXT (again see <ac:link><ri:page ri:content-title=\"OpenXT Process - Historical\" ri:space-key=\"CS\"></ri:page></ac:link>). This is a starting point and the model will grow and evolve over time as the community grows and changes.</p>",
    "date": "2024-11-15",
    "disclaimer": "Users of this benchmark dataset are advised to check Atlassian’s official documentation for the most current information.",
    "space": "~rphilipson"
}