{
    "id": "confluence-030",
    "title": "Hardware Guide",
    "url": "https://openxt.atlassian.net/wiki/spaces/OD/pages/14844112/Hardware+Guide",
    "content": "<p>Owned by Ross Philipson\nLast updated: Sep 25, 2015 by Ross Philipson\n\n</p><p>This page documents the hardware features used and required by OpenXT. Where certain features are optional this will be made explicit. We will be tracking tested platforms on a separate HCL wiki page - coming soon. This page is intended to give a narrative describing the features used, why, the software components that depend on specific hardware features and whether or not they're optional or required.</p><p>OpenXT is currently tied very closely to Intel CPU features. You'll see a lot of Intel-specific language on this page. Hopefully in the future we'll be adding support for additional CPUs from other manufacturers.</p><h2>Hardware Assisted Virtualization</h2><p><span>Often abbreviated 'HVM'. Intel VT-x is required.</span></p><h2>Input/Output Memory Management Unit</h2><p><span>Often abbreviated 'IOMMU'. Intel VT-d is required.</span></p><h2>Measured Launch</h2><p><span>Intel Trusted Execution Technology 'TXT' is required for measured launch. This is an optional component but if you want to encrypt guest VM disks it is highly recommended. The secrecy of the encryption keys for the guest disks are protected by measured launch. We need a wiki page dedicated to this with a real explanation.</span></p><h2>Trusted Platform Module</h2><p><span><span>Often abbreviated 'TPM'. A TPM is required for the use of Measured Launch.</span></span></p><h2>AES crypto acceleration</h2><p><span><span><span>Hardware assistance for AES cryptographic operations is optional. However guest disk encryption is very slow and battery life will be degraded without it. Currently we use OpenSSL with the Intel AES-NI instructions.</span></span></span></p><h2>How can I determine a system might be compatible?</h2><p><span><span><span><span>To be vPro compatible there needs to be vPro support in the CPU, motherboard chipset and networking chipset. The best place to look up information is at the Intel Ark site.</span><a href=\"http://ark.intel.com/\">http://ark.intel.com</a><span> Each component should list if it supports vPro, i.e. the Intel i217LM/i218LM NICs support vPro whereas the Intel i210 does not. Remember that assembling all vPro compatible components does not mean OpenXT will definitely work on the machine. Remember to check the Hardware matrix to see what has been tested so far.</span></span></span></span></p>",
    "date": "2024-11-15",
    "disclaimer": "Users of this benchmark dataset are advised to check Atlassian’s official documentation for the most current information.",
    "space": "OD"
}