{
    "id": "confluence-178",
    "title": "Community Call - Auguest 18 2016",
    "url": "https://openxt.atlassian.net/wiki/spaces/CS/pages/52330510/Community+Call+-+Auguest+18+2016",
    "content": "<p>Owned by Ross Philipson\nLast updated: Aug 18, 2016 by Ross Philipson\n\n</p><h2>Dial-In Information</h2><p>Bridge Number: 1-315-533-6194</p><p>Passcode: 998 566 967</p><h2>Agenda</h2><p>- OpenXT 6.0.0 closedown<br/> - OpenXT 6.1.0 planning<br/> - OpenXT 7.0 planning: Kaby Lake<br/> - blktap3<br/> - V4V roadmap (moved to next month)<br/> - Security mailing list status<br/> - Signing Windows 7, 8, 10 PV drivers and co-existence with upstream's signed drivers<br/> - Roadmap for reducing/removing Qemu security risk, see Qubes discussion of PVH1, PVH2 at <a href=\"https://github.com/QubesOS/qubes-issues/issues/2185\">https://github.com/QubesOS/qubes-issues/issues/2185</a>, including idea about terminating Qemu after boot<br/> - Xen uprev to 4.6 and Xen 4.7 (part of OpenXT 7.0 planning)</p><h2>Meeting Notes/Action Items</h2><ul><li>6.0 release to be called on Monday or Tuesday next week, if testing continues to look good</li><li>6.1 release timetable to track the Measured Launch work, which is tricky to timebox at the moment.<ul><li>At present hoping for a small number of weeks rather than months</li><li>No major rearchitecting of code under consideration for stable-6, no major feature additions bar the ML change</li><li>Current v4v fixes to be rolled into the 6.1 release</li><li>4.4 Linux kernel tracking to also be included</li><li>Security fixes as identified to be rolled in</li></ul></li><li>* 7.0 to target integration of meta-virtualization and Xen 4.6. There is a desire to include an OE update.<ul><li>Closely related to work on Xen 4.6 and 4.7</li><li>Ross will create an epic to track general OE cleanup and link tickets.</li><li>Jed filed OXT-580 to track the work to reduce our delta vs. upstream OE recipes: <a href=\"https://openxt.atlassian.net/browse/OXT-580\" rel=\"nofollow\">https://openxt.atlassian.net/browse/OXT-580</a></li><li>Consensus that everyone chipping away at these would be good</li><li>Possibly include the libxl work - much TBD on that one.</li></ul></li><li>* Discussion between Daniel, Ross, Machon, Rich re: documenting the release process we just performed to the wiki<ul><li>Ross was to take this and add perspective on encountered difficulties, what worked, what we should aim to improve</li></ul></li><li>* libxl / OpenXT toolstack work is under way in personal repos on github, with a wiki page being kept up to date<ul><li><a href=\"https://openxt.atlassian.net/wiki/display/DC/xl+Migration\" rel=\"nofollow\">https://openxt.atlassian.net/wiki/display/DC/xl+Migration</a></li><li>AIS team will give a presentation on the current state of the libxl toolstack work on the next community call</li></ul></li></ul><ul><li>* OpenEmbedded's support for Jethro appear to expire in October<ul><li>Rich to contact Philip Balister to obtain the definitive OE position on the project support lifecycle for OE branches and releases</li><li>We likely need to look at shifting our base platform to Krogoth or its successor for the 7.0 release</li></ul></li><li>* Rich to ping Qubes team re: any potential interest in our PV-USB implementation<ul><li>Has been significantly improved since they last evaluated the USB stack we were using</li><li>Current OpenXT USB stack has just passed our 6.0 release testing with good results</li></ul></li><li>* Security mailing list: Daniel provided Christopher with guidance on tool selection<ul><li>Zoho service looks OK</li><li>Script hosting environment for mail processing before forwarding to OpenXT recipients still to be determined</li></ul></li><li>* blktap3 discussion: to continue in reply to Ross's email thread on list</li></ul><h2>Attendees</h2><p>Eric Chanudet - AIS</p><p>Christopher Clark - BAE</p><p>Magali Denis - AIS</p><p>Machon Gregory - NSA</p><p>Jed Lejosne - AIS</p><p>Steve Meisner - AIS</p><p>Martin Osterloh - AIS</p><p>Rich Persaud - BAE</p><p>Ross Philipson - AIS</p><p>Jim Rauscher - NSA</p><p>Stephen Smalley - NSA</p><p>Daniel Smith - <span style=\"color: rgb(34,34,34);\">Apertus Solutions</span></p><p><span style=\"color: rgb(34,34,34);\"><br/></span></p><p> </p>",
    "date": "2024-11-15",
    "disclaimer": "Users of this benchmark dataset are advised to check Atlassian’s official documentation for the most current information.",
    "space": "CS"
}