{
    "id": "confluence-206",
    "title": "August 2017 OpenXT Community Call",
    "url": "https://openxt.atlassian.net/wiki/spaces/CS/pages/78058551/August+2017+OpenXT+Community+Call",
    "content": "<p>Owned by Rich Persaud\nLast updated: Aug 17, 2017 by Rich Persaud\n\n</p><p><strong>7.0.0 Triage Call Minutes</strong></p><ul><li>Most RC2 issues have been addressed.  Main outstanding issue is xenstored stability, for which a fix is under development, expected within 2 weeks.  After this fix is tested and merged, there are no known issues that would block release.  All users are encouraged to test RC2 and report any issues found.  If there is an existing ticket which is not prioritized, please comment on the ticket.</li><li>Please update the HCL page after testing RC2:  <ac:link><ri:page ri:content-title=\"OpenXT 7.0 Hardware Testing\" ri:space-key=\"TEST\" ri:version-at-save=\"8\"></ri:page></ac:link><br/><br/></li></ul><p><strong>Monthly Call Agenda</strong></p><p><em>* OpenXT 7.1.0 Planning</em><br/><em>  </em>- Intel Coffee Lake (8th gen) platform<br/>  - Windows 10 guest EFI support for Xen 4.6<br/>  - Windows 10 Hyper-V as nested hypervisor for Xen 4.6<br/><span>  - tools for building service VMs</span><br/>  - meta-measured layer support</p><p><em>* OpenXT 8.0.0 Planning</em><br/>  - Xen 4.8 and 4.9 uprev<br/>  - blktap (upstream XSA support ending)<br/>  - blktap3 (who will maintain: github vs XenServer code? out of tree = no XSA support?)<br/>  - upstreaming some OpenXT patches: Xen, XSM (VT-d), libxl, V4V, Linux stubdoms<br/>  - tboot (Xen Summit design discussion)<br/>  - toolstack: libvirt, xenmgr plugins, xenstore disaggregation<br/>  - meta-virtualization layer support</p><p><br/></p><p><strong>Monthly Call Minutes</strong></p><p><em>stable-6 planning</em></p><ul><li>(AIS) Rich: ongoing support is needed for this branch</li></ul><p><em>stable-7 branch and 7.1.0 Planning</em></p><ul><li>(AIS) Rich: Coffee Lake will not be socket-compatible with Kaby Lake, will likely require Linux kernel uprev to support new motherboards.   Xen uprev should not be needed for Coffee Lake, hence it can likely be supported in the stable-7 branch with Xen 4.6.   Timeframe is 1Q18.</li></ul><p><em>8.0.0 Planning</em></p><ul><li>Xen 4.9<ul><li>(BAE) Christopher ported OpenXT patches to Xen 4.9 in preparation for upstreaming some patches, including V4V.   Two Xen patches have already been upstreamed and Xen 4.9 support has been upstreamed to OE/Yocto meta-virtualization.  </li><li>(AIS) Jed +1 for moving to Xen 4.9 in master/8.0.0</li><li>(BAE) Rich requested help from AIS to review, test and improve the Xen 4.9 code</li></ul></li><li>UEFI and Nested Virtualization<ul><li>(AIS) Bradley (UEFI host) and Jonathan (UEFI guest) will take over PR #729 submitted by William</li><li>(AIS) Nested hypervisor implementation is inefficient, will be improved by Tamas L (new team member and Xen maintainer).  Upstream Xen work is underway to reduce impact of Xen scheduler on nested hypervisor performance.</li></ul></li><li>blktap uprev<ul><li>(AIS) Boston team will work on blktap3, after Xen 4.9 is merged.  </li><li>(BAE) Rich recommended comparing blktap3 github code with version on XenServer source ISO, because github commits are not regular and there are outstanding PRs.</li></ul></li><li>tboot<ul><li>(BAE) Rich reported on Xen Summit EFI/tboot design session about implementing some tboot capabilities in Xen and eliminating the need for tboot.  If this design effort moves forward, it will be announced on xen-devel.</li></ul></li><li>Other work in progress<ul><li>(AIS) Eric: OE pyro uprev, mostly done except for Ocaml layer.</li><li>(AIS) Rich: investigating Haskell workarounds for 32-bit dom0 restriction.</li></ul></li></ul><p><em>Upstreaming Xen patches</em></p><ul><li>(BAE) Rich and Christopher had positive discussions at Xen Summit about upstreaming, including V4V, Linux stubdoms and other libxl improvements.</li><li>(AIS) Steve: Xen upstreaming is of interest but not currently resourced, more planning needed.</li></ul><p><br/></p><p><strong>September Community Call Agenda </strong></p><ul style=\"list-style-type: square;\"><li>Wrap-up 7.0.0 release</li><li>Maintainer for stable-6 branch (6.0.x)</li><li>Release manager for next stable-7 release (7.0.x, 7.1.x)</li><li>Release manager for 8.0.0</li></ul><p><br/></p>",
    "date": "2024-11-15",
    "disclaimer": "Users of this benchmark dataset are advised to check Atlassian’s official documentation for the most current information.",
    "space": "CS"
}