{
    "id": "confluence-208",
    "title": "September 2017 OpenXT Community Call - Restored",
    "url": "https://openxt.atlassian.net/wiki/spaces/CS/pages/138706945/September+2017+OpenXT+Community+Call+-+Restored",
    "content": "<p>Owned by Rich Persaud\nLast updated: Nov 13, 2017 by Former user (Deleted)\n\n</p><div><div><p><em><span style=\"color: rgb(255,255,255);margin-left: 0.0px;\">master (8.0.0)</span></em></p><ul><li>Notes from feature discussion<br/><ul><li style=\"margin-left: 0.0px;\">UEFI (host and guest), Secure Boot for Windows 10</li><li style=\"margin-left: 0.0px;\">Kconfig - define minimal Xen config early in 8.0 dev cycle, so that testing &amp; feature development are done on the minimized base</li><li style=\"margin-left: 0.0px;\">USB3 - no high-priority devices currently need USB3, USB-C ports are compatible</li><li style=\"margin-left: 0.0px;\">USB driver domain - of interest, will be investigated, not yet committed within 8.0 timeframe, Qubes has an implementation</li><li style=\"margin-left: 0.0px;\">HVM and SR-IOV driver domains - security benefits, see upstream Xen mailing list discussion (SUPPORT.md) about x86 PCI passthrough security</li><li style=\"margin-left: 0.0px;\">libvirt - needs scoping, starting point would be for Chris Rogers to create a wiki page which documents OpenXT Haskell toolstack functions that would need to be migrated to another toolstack, whether libvirt or something else.  There will always be some OpenXT-specific toolstack functions that are not provided by an existing toolstack like libvirt.  This is a big task, we need to create small prototypes to identity candidates for replacing subsets of Haskell code.</li><li style=\"margin-left: 0.0px;\">Hyper-V guest enlightenments - of interest, is available in Xen 4.9, can be an optional build configuration for OpenXT 8.0</li><li style=\"margin-left: 0.0px;\">Display manager &amp; input server - no objection to the community introducing a new, optional, open-source display/input stack</li><li style=\"margin-left: 0.0px;\">Upstream OE - some 8.0 OpenXT features may appear first in upstream OpenEmbedded meta-virtualization (master), then get pulled into OpenXT</li><li style=\"margin-left: 0.0px;\">OE pyro uprev - work underway (Eric), making Haskell toolchain fixes</li><li style=\"margin-left: 0.0px;\">blktap3 - work underway, see <ac:structured-macro ac:macro-id=\"70fc9dd7-9a52-46f9-a8d1-805a2953efec\" ac:name=\"jira\" ac:schema-version=\"1\"><ac:parameter ac:name=\"server\">System JIRA</ac:parameter><ac:parameter ac:name=\"serverId\">87e67eec-7c89-3635-99bf-e58e55630835</ac:parameter><ac:parameter ac:name=\"key\">OXT-1221</ac:parameter></ac:structured-macro> (Mahantesh)</li><li style=\"margin-left: 0.0px;\">nested virt (Hyper-V) - targeted for 8.0 release, no backport to stable-7</li></ul></li></ul></div></div>",
    "date": "2024-11-15",
    "disclaimer": "Users of this benchmark dataset are advised to check Atlassian’s official documentation for the most current information.",
    "space": "CS"
}